model {
  faster_rcnn {
    num_classes: 13
    image_resizer {
      fixed_shape_resizer {
        width: 1000
        height: 1000
      }
    }
    feature_extractor {
      type: 'faster_rcnn_resnet50'
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 500
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.600000023842
        max_detections_per_class: 500
        max_total_detections: 500
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}
train_config {
  batch_size: 2
  sync_replicas: true
  replicas_to_aggregate: 12
  data_augmentation_options {
    random_adjust_brightness {}
    random_adjust_contrast {}
    random_adjust_hue {}
    random_adjust_saturation {}
    random_distort_color {}
    random_horizontal_flip {}
    random_vertical_flip {}
    random_rotation90 {}
  }
  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.003200000018999
          min_learning_rate: 0.000032
          decay_steps: 1050
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 100.0
  fine_tune_checkpoint: "../../resources/models/faster_rcnn_resnet50_coco_2018_01_28/model.ckpt"
  from_detection_checkpoint: true
  batch_queue_capacity: 30

}

train_input_reader: {
  tf_record_input_reader {
    input_path: "../../resources/drawui/training.record-0000?-of-00002"
  }
  label_map_path: "../../resources/drawui/labelmap.pbtxt"
  shuffle_buffer_size: 100
  queue_capacity: 20
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_examples: 263
  num_visualizations: 263
  include_metrics_per_category: true
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "../../resources/drawui/validation.record-0000?-of-00002"
  }
  label_map_path: "../../resources/drawui/labelmap.pbtxt"
  shuffle: false
  num_readers: 1
  queue_capacity: 8
}
